src/ex_Tabakon/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/CommonModules/УчетНДС/Ext/Module.bsl
//Марк 2026-01-14 НДС22
&Вместо("СтавкаНДСПоУмолчанию")
Функция ТБКСтавкаНДСПоУмолчанию(Дата)
	
	ДатаПолучения = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Если ДатаПолучения >= ДатаПереходаНаНДС22() Тогда
		Возврат Перечисления.СтавкиНДС.НДС22;
	ИначеЕсли ДатаПолучения >= ДатаПереходногоПериода() Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	Иначе
		Возврат Перечисления.СтавкиНДС.НДС18;
	КонецЕсли;
	                     	
КонецФункции 

Функция ДатаПереходаНаНДС22() Экспорт
	
	Возврат Дата(2026, 1, 1);
	
КонецФункции 

&Вместо("СкорректироватьСтавкуНДС")
Функция ТБКСкорректироватьСтавкуНДС(СтавкаНДС, Дата)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		
		СтавкаНДС = СтавкаНДСПоУмолчанию(Дата);
		
	КонецЕсли;
	
	Возврат СтавкаНДС;

КонецФункции
